[
  {
    "title": "Only Education",
    "slug": "only-education",
    "website": "https://onlyeducation.com",
    "banner": "/assets/img/portfolio-img/Onlyedu-cover2.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "Only Education was facing the complex task of asserting credibility and visibility in an oversaturated EdTech environment. Despite a growing user base, the brand lacked a centralised strategy to attract and retain students across disciplines. Their website did not reflect their pedagogical strengths, and the marketing funnel was fragmented, impacting both traffic and conversions.",
        "image": "/assets/img/portfolio-img/Onlyedu-cover2.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "RankKit delivered a comprehensive brand overhaul by producing high-quality ad films, educational content, and professional branding videos. The team launched a robust SEO strategy, segmented social media campaigns, LinkedIn positioning, and automated marketing workflows through email and WhatsApp. Technical enhancements to the site structure, content architecture, and GMB optimisation were also undertaken to boost discoverability.",
        "images": [
          {
            "type": "video",
            "src": "/videos/onlyEducationVideo.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/phoneonlyedu2.png"
          } 
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Post-intervention, Only Education saw a 65% uplift in organic keyword visibility and a 50% rise in qualified web traffic. Social media engagement rates improved by 90%, and advertising efficiency increased through a 25% reduction in cost-per-acquisition. The result was a unified digital presence that positioned Only Education as a trustworthy and technologically advanced academic counselling platform in India."}
    ]
  },
  {
    "title": "NEET Gyan",
    "slug": "neet-gyan",
    "website": "https://neetgyan.in",
    "banner": "/assets/img/portfolio-img/neetgyaancover2.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "NEETGyan, despite a strong content base, faced visibility issues in the saturated NEET prep space. Lack of SEO refinement, keyword targeting, and mobile responsiveness limited organic reach and discoverability. Without strategic optimization, it struggled to convert traffic into engaged learners or establish digital authority among serious medical aspirants.",
        "image": "/assets/img/portfolio-img/neetgyaancover2.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "RankKit applied a NEET-specific SEO overhaul, including deep keyword mapping across core subjects, structured data, and mobile UX optimization. We enhanced load speed, schema, and backlinking via academic platforms and student communities. These enhancements created an ecosystem aligned with search intent, content performance, and ranking improvements across competitive keyword clusters.",
        "images": [
          {
            "type": "video",
            "src": ""
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/neetgyaanmock.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Within weeks, NEETGyan saw a 50% surge in organic traffic and page dwell time. Rankings improved for high-volume keywords, driving growth in mock test registrations and sign-ups. With improved visibility and user flow, NEETGyan cemented its place as a dependable prep platform for NEET aspirants nationwide."
      }
    ]
  },
  {
    "title": "The Kerala Table",
    "slug": "the-kerala-table",
    "website": "https://thekeralatable.com",
    "banner": "/assets/img/portfolio-img/tktlaptopcover.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "The Kerala Table needed a digital identity that was rooted in tradition yet tailored for premium online experiences. Its original site lacked warmth, regional flavor, and seamless user flows for ordering — creating a gap between brand essence and user engagement, especially for digital-first food lovers.",
        "image": "/assets/img/portfolio-img/tktlaptopcover.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "We redesigned the platform to combine Kerala's cultural motifs with modern UI/UX. A custom CMS allowed dynamic menu management, while integrated delivery and feedback modules ensured a smooth user journey. Mobile optimization ensured seamless browsing, ordering, and reordering, converting first-time visitors into returning food lovers.",
        "images": [
          {
            "type": "video",
            "src": "/videos/tkt.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/Tktphonemockup.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Within two months, online orders grew 3x and customer retention climbed to 65%. Social and menu integration improved engagement, and the new digital identity attracted premium diners looking for regional authenticity and convenience. The Kerala Table is now both a beloved brand and a scalable digital restaurant.",
        "image": "/assets/img/inner-project/portfolio-details-3/kerala-4.jpg"
      }
    ]
  },
  {
    "title": "Only Engineering",
    "slug": "only-engineering",
    "website": "https://onlyengineering.in",
    "banner": "/assets/img/portfolio-img/Onlyengineeringcover2.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "Only Engineering needed a structured platform to simplify complex engineering entrance prep. Its previous setup lacked visual hierarchy and interactive test dashboards, making it difficult for students to track performance or engage deeply with analytical tools and mentorship insights required for competitive exams like JEE.",
        "image": "/assets/img/portfolio-img/Onlyengineeringcover2.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "We created a modular interface with intuitive dashboards, performance visualizations, and tiered content discovery. The platform used progressive disclosure and responsive layouts to handle dense data seamlessly. A mentorship dashboard and college predictor tools added value and converted passive users into high-intent aspirants.",
        "images": [
          {
            "type": "video",
            "src": "/videos/onlyEducationVideo.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/Onlyenginineeringmock.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "The platform achieved a 45% increase in session engagement and 12+ minutes average time-on-site. User feedback praised the clarity, structure, and speed. With real-time performance tracking and improved navigation, Only Engineering became a high-engagement destination for India’s competitive engineering test takers.",
        "image": "/assets/img/inner-project/portfolio-details-3/onlyeng-4.jpg"
      }
    ]
  },
  {
    "title": "MBA CET",
    "slug": "mba-cet",
    "website": "https://mbacet.in",
    "banner": "/assets/img/portfolio-img/mbacetcover.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "MBA CET aspirants needed a prep space that combined analytics, clarity, and smart filters. The earlier site lacked personalized journeys, real-time feedback, and mentor guidance — leading to drop-offs and limited conversion from visitors to course-takers in a high-stakes exam landscape.",
        "image": "/assets/img/portfolio-img/mbacetcover2.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "We built a flexible mock test engine, real-time leaderboards, and a dynamic mentor-booking feature. Filters allowed students to explore B-schools by ROI, city, and specialization. Backend analytics tracked user flow to optimize course recommendations and guide students through every stage of the preparation funnel.",
        "images": [
          {
            "type": "video",
            "src": "/videos/onlyEducationVideo.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/mbacetmock.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Post-launch, course completion rates jumped 58% and user retention increased significantly. Personalized dashboards and structured paths improved learning outcomes, while smart filters increased lead-to-admission conversion. The revamped platform now serves as a performance-driven preparation engine for MBA CET aspirants across Maharashtra.",
        "image": "/assets/img/inner-project/portfolio-details-3/mbacet-4.jpg"
      }
    ]
  },
  {
    "title": "KALP",
    "slug": "kalp",
    "website": "https://kalpedu.in",
    "banner": "/assets/img/portfolio-img/kalpcoverimg2.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "KALP’s robust school ERP lacked a user-friendly frontend and mobile optimization. Admins faced workflow challenges, while parents struggled with fragmented communication and update tracking. The system needed simplification, modern design, and real-time responsiveness to boost overall usability across stakeholder groups.",
        "image": "/assets/img/portfolio-img/kalpcoverimg2.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "We reimagined the ERP with mobile-first dashboards for admins, teachers, and parents. Modules like attendance, assignments, exam results, and notifications were made intuitive, with real-time alerts and a focus on clarity. Parent-teacher interaction flows were optimized to feel seamless and collaborative.",
        "images": [
          {
            "type": "video",
            "src": "/videos/kalp.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/kalpphonemockup.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Admin workload reduced by 43%, and parent update engagement hit 98%. The sleek new UX increased trust and daily usage, transforming KALP from a traditional ERP into a smart school operations assistant — functional, intuitive, and responsive across all devices.",
        "image": "/assets/img/inner-project/portfolio-details-3/kalp-4.jpg"
      }
    ]
  },
  {
    "title": "Bake Ur Day",
    "slug": "bake-ur-day",
    "website": "https://bakeurday.in",
    "banner": "/assets/img/portfolio-img/bakeurdaycoverimg2.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "Bake Ur Day aimed to reflect its cheerful bakery vibe online but struggled with inconsistent branding and poor checkout UX. The site lacked visual personality and had high cart abandonment, limiting growth despite having a loyal offline customer base.",
        "image": "/assets/img/portfolio-img/bakeurdaycoverimg2.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "We created a pastel-themed brand language using handwritten fonts and motion-based micro-interactions. The cart and checkout process was overhauled to reduce friction. Product highlights, real-time order tracking, and simplified payment flows were built to encourage more purchases and loyalty.",
        "images": [
          {
            "type": "video",
            "src": "/videos/bake_your_day.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/bakeurdayphonemock.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Sales doubled within 3 months of relaunch, with improved checkout conversions and positive customer feedback on the shopping experience. Bake Ur Day’s brand now feels as delightful online as it does in-store, driving both emotional connection and revenue growth.",
        "image": "/assets/img/inner-project/portfolio-details-3/bake-4.jpg"
      }
    ]
  },
  {
    "title": "Toy Room",
    "slug": "toy-room",
    "website": "https://toyroom.in",
    "banner": "/assets/img/portfolio-img/Toyroomcoverimg2.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "Toy Room needed to appeal to kids visually while remaining practical for parents. The old platform lacked engaging content, smooth shopping flows, and effective filters — resulting in low conversions and limited repeat purchases despite a strong product lineup.",
        "image": "/assets/img/portfolio-img/Toyroomcoverimg2.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "We built a vibrant, playful UI with child-friendly animations and clean navigation. The eCommerce platform featured category-based filters, bundle deals, and toy video demos. Parents could easily browse, compare, and order — all in a mobile-optimized, clutter-free environment.",
        "images": [
          {
            "type": "video",
            "src": "/videos/toy_room.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/Toyroom-mock.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Post-redesign, average cart size grew 2.4x and customer satisfaction scores touched 4.9/5. The site became a destination for joyful, trust-based toy shopping — balancing fun for kids and convenience for parents with equal care.",
        "image": "/assets/img/inner-project/portfolio-details-3/toy-4.jpg"
      }
    ]
  },
  {
    "title": "Cossy Box",
    "slug": "cossy-box",
    "website": "https://cossybox.in",
    "banner": "/assets/img/portfolio-img/cossylaptopmock.png",
    "sections": [
      {
        "heading": "The Challenge",
        "tagline": "An introduction",
        "description": "Cossy Box, despite its cozy interiors and curated culinary experiences, lacked a digital presence that mirrored its in-store ambiance. The absence of an intuitive website and online ordering flow was limiting its reach among urban diners who prioritize digital-first discovery, table bookings, and delivery convenience.",
        "image": "/assets/img/portfolio-img/cossylaptopmock.png"
      },
      {
        "heading": "The Solution",
        "tagline": "Strategic Revival",
        "description": "We crafted a premium digital experience reflecting Cossy Box’s warm yet sophisticated vibe. The new site featured immersive visuals, mood-based menu browsing, and smooth reservation/delivery integrations. A centralized CMS made content updates effortless, while mobile responsiveness ensured consistency across all screen sizes, turning browsers into loyal diners.",
        "images": [
          {
            "type": "video",
            "src": "/videos/cossy-box.mp4"
          },
          {
            "type": "image",
            "src": "/assets/img/portfolio-img/cossymockphone.png"
          }
        ]
      },
      {
        "heading": "The Impact",
        "tagline": "Proof in Performance",
        "description": "Cossy Box saw a 4x jump in table reservations within the first quarter. The revamped UI/UX elevated its perception as a lifestyle destination, not just a dining space. Social shares increased 3.5x, average session time rose by 60%, and the streamlined order flow boosted delivery revenue significantly.",
        "image": "/assets/img/inner-project/portfolio-details-3/cossy-impact.jpg"
      }
    ]
  },
  {
  "title": "ITC Limited",
  "slug": "itc",
  "website": "https://www.itcportal.com",
  "banner": "",
  "bannerVideo": "/videos/ITC_LOLLA_COVER_VID.mp4",
  "sections": [
    {
      "heading": "The Challenge",
      "tagline": "An introduction",
      "description": "Despite being a century-old conglomerate with a diverse portfolio spanning FMCG, hospitality, and agribusiness, ITC faced a perception challenge in digitally connecting with Gen Z and millennial consumers. Its web presence lacked personalization, real-time engagement, and the storytelling needed to reflect its innovation beyond tobacco roots.",
      "image": "/assets/img/portfolio-img/itclaptopmock.png"
    },
    {
      "heading": "The Solution",
      "tagline": "Strategic Revival",
      "description": "We reimagined ITC’s online identity with a unified digital framework that elevated its multifaceted brand voice. A dynamic homepage with immersive storytelling brought each vertical—FMCG, Hotels, Paperboards, Agri, and Infotech—to life. The redesigned platform incorporated sustainability highlights, real-time investor dashboards, and SEO-rich product showcases, delivering trust at scale.",
      "images": [
        {
          "type": "video",
          "src": "/videos/Singleportfolio_vid1.mp4"
        },
        {
          "type": "video",
          "src": "/videos/Singleportfolio_vid2.mp4"
        }
      ]
    },
    {
      "heading": "The Impact",
      "tagline": "Proof in Performance",
      "description": "Post-launch, ITC saw a 5x increase in page engagement across its non-tobacco verticals. The refreshed brand positioning improved its digital trust metrics, with average session duration increasing by 70%. Traffic from Tier-1 and Tier-2 cities surged, and sustainability content shares grew 4.2x—reinforcing ITC’s role as a future-ready enterprise.",
      "image": "/assets/img/inner-project/portfolio-details-3/itc-impact.jpg"
    }
  ]
}
]
